TestCases/laminar/NH3_31s/constant/speciesThermo
species         31 ( AR HE H2 H O2 O H2O OH H2O2 HO2 NO N2O NO2 HNO HNO2 HONO HONO2 N2H2 H2NN NH2OH HNOH NH3 N2H4 N NO3 NH NNH NH2 H2NO N2H3 N2);

NO3
{
    specie
    {
        molWeight       62.0049;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           6000;
        Tcommon         1000;
        highCpCoeffs    ( 7.48347702 0.00257772064 -1.00945831e-06 1.72314063e-10 -1.07154008e-14 6129.90474 -14.1618136 );
        lowCpCoeffs     ( 2.1735933 0.0104902685 1.10472669e-05 -2.81561867e-08 1.3658396e-11 7812.90905 14.602209 );
    }
    transport
    {
        As              1.512e-06;
        Ts              120;
    }
    elements
    {
        N               1;
        O               3;
    }
}

HONO
{
    specie
    {
        molWeight       47.01347;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           6000;
        Tcommon         1000;
        highCpCoeffs    ( 5.79144641 0.00364630732 -1.29112765e-06 2.06498233e-10 -1.22138679e-14 -11597.4343 -4.07145349 );
        lowCpCoeffs     ( 3.16416438 0.00850517773 5.48561573e-07 -8.27656474e-09 4.39957151e-12 -10774.4086 10.0231941 );
    }
    transport
    {
        As              1.512e-06;
        Ts              120;
    }
    elements
    {
        H               1;
        N               1;
        O               2;
    }
}

OH
{
    specie
    {
        molWeight       17.00737;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           6000;
        Tcommon         1000;
        highCpCoeffs    ( 2.84581721 0.00109723818 -2.89121101e-07 4.0909991e-11 -2.31382258e-15 3717.0661 5.80339915 );
        lowCpCoeffs     ( 3.97585165 -0.00228555291 4.33442882e-06 -3.5992664e-09 1.2670693e-12 3393.41137 -0.0355397262 );
    }
    transport
    {
        As              1.512e-06;
        Ts              120;
    }
    elements
    {
        H               1;
        O               1;
    }
}

HNOH
{
    specie
    {
        molWeight       32.02204;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           6000;
        Tcommon         1000;
        highCpCoeffs    ( 3.98321933 0.00488846374 -1.65086637e-06 2.55371446e-10 -1.48308561e-14 10578.0106 3.62582838 );
        lowCpCoeffs     ( 3.95608248 -0.0030261102 2.56874396e-05 -3.1564512e-08 1.24084574e-11 10919.979 5.55950983 );
    }
    transport
    {
        As              1.512e-06;
        Ts              120;
    }
    elements
    {
        H               2;
        N               1;
        O               1;
    }
}

N2
{
    specie
    {
        molWeight       28.0134;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           6000;
        Tcommon         1000;
        highCpCoeffs    ( 2.9380297 0.0014183803 -5.03281045e-07 8.07555464e-11 -4.76064275e-15 -917.18099 5.95521985 );
        lowCpCoeffs     ( 3.53603521 -0.000158270944 -4.26984251e-07 2.3754259e-09 -1.39708206e-12 -1047.49645 2.94603724 );
    }
    transport
    {
        As              1.512e-06;
        Ts              120;
    }
    elements
    {
        N               2;
    }
}

N
{
    specie
    {
        molWeight       14.0067;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           6000;
        Tcommon         1000;
        highCpCoeffs    ( 2.4159429 0.00017489065 -1.1902369e-07 3.0226244e-11 -2.0360983e-15 56133.775 4.6496095 );
        lowCpCoeffs     ( 2.5 0 0 0 0 56104.638 4.1939088 );
    }
    transport
    {
        As              1.512e-06;
        Ts              120;
    }
    elements
    {
        N               1;
    }
}

HNO
{
    specie
    {
        molWeight       31.01407;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           6000;
        Tcommon         1000;
        highCpCoeffs    ( 3.16598124 0.00299958892 -3.94376786e-07 -3.85344089e-11 7.07602668e-15 11772.6311 7.64511172 );
        lowCpCoeffs     ( 4.53525574 -0.00568543377 1.8519854e-05 -1.71881225e-08 5.55818157e-12 11618.3003 1.74315886 );
    }
    transport
    {
        As              1.512e-06;
        Ts              120;
    }
    elements
    {
        H               1;
        N               1;
        O               1;
    }
}

N2H3
{
    specie
    {
        molWeight       31.03731;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           6000;
        Tcommon         1000;
        highCpCoeffs    ( 4.04483566 0.00731130186 -2.47625799e-06 3.83733021e-10 -2.23107573e-14 25324.142 2.88423392 );
        lowCpCoeffs     ( 3.42125505 0.0013490159 2.23459071e-05 -2.99727732e-08 1.2097897e-11 25819.8956 7.83176309 );
    }
    transport
    {
        As              1.512e-06;
        Ts              120;
    }
    elements
    {
        N               2;
        H               3;
    }
}

H2NO
{
    specie
    {
        molWeight       32.02204;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           6000;
        Tcommon         1000;
        highCpCoeffs    ( 3.75555914 0.00516219354 -1.76387387e-06 2.75052692e-10 -1.60643143e-14 6518.26177 4.30933053 );
        lowCpCoeffs     ( 3.93201139 -0.000164028165 1.39161409e-05 -1.62747853e-08 6.00352834e-12 6711.78975 4.58837038 );
    }
    transport
    {
        As              1.512e-06;
        Ts              120;
    }
    elements
    {
        N               1;
        H               2;
        O               1;
    }
}

NH3
{
    specie
    {
        molWeight       17.03061;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           4000;
        Tcommon         1000;
        highCpCoeffs    ( 2.36074311 0.00631850146 -2.28966806e-06 4.11767411e-10 -2.90836787e-14 -6415.96473 8.02154329 );
        lowCpCoeffs     ( 4.14027871 -0.00358489142 1.89475904e-05 -1.9883397e-08 7.15267961e-12 -6685.45158 -0.0166754883 );
    }
    transport
    {
        As              1.512e-06;
        Ts              120;
    }
    elements
    {
        H               3;
        N               1;
    }
}

H2O2
{
    specie
    {
        molWeight       34.01474;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           6000;
        Tcommon         1000;
        highCpCoeffs    ( 4.5401748 0.00415970971 -1.30876777e-06 2.00823615e-10 -1.15509243e-14 -17951.4029 0.855881745 );
        lowCpCoeffs     ( 4.2385416 -0.000249610911 1.59857901e-05 -2.06919945e-08 8.2976632e-12 -17648.6003 3.58850097 );
    }
    transport
    {
        As              1.512e-06;
        Ts              120;
    }
    elements
    {
        H               2;
        O               2;
    }
}

NNH
{
    specie
    {
        molWeight       29.02137;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           6000;
        Tcommon         1000;
        highCpCoeffs    ( 3.42744423 0.00323295234 -1.17296299e-06 1.90508356e-10 -1.14491506e-14 28767.6026 6.39209233 );
        lowCpCoeffs     ( 4.25474632 -0.00345098298 1.37788699e-05 -1.33263744e-08 4.41023397e-12 28793.208 3.28551762 );
    }
    transport
    {
        As              1.512e-06;
        Ts              120;
    }
    elements
    {
        N               2;
        H               1;
    }
}

N2O
{
    specie
    {
        molWeight       44.0128;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           6000;
        Tcommon         1000;
        highCpCoeffs    ( 4.8230729 0.0026270251 -9.5850872e-07 1.6000712e-10 -9.7752302e-15 8073.4047 -2.2017208 );
        lowCpCoeffs     ( 2.2571502 0.011304728 -1.3671319e-05 9.6819803e-09 -2.9307182e-12 8741.7746 10.757992 );
    }
    transport
    {
        As              1.512e-06;
        Ts              120;
    }
    elements
    {
        N               2;
        O               1;
    }
}

O2
{
    specie
    {
        molWeight       31.9988;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           6000;
        Tcommon         1000;
        highCpCoeffs    ( 3.65980488 0.000659877372 -1.44158172e-07 2.14656037e-11 -1.36503784e-15 -1216.03048 3.42074148 );
        lowCpCoeffs     ( 3.78498258 -0.00302002233 9.92029171e-06 -9.77840434e-09 3.28877702e-12 -1064.13589 3.64780709 );
    }
    transport
    {
        As              1.512e-06;
        Ts              120;
    }
    elements
    {
        O               2;
    }
}

H2
{
    specie
    {
        molWeight       2.01594;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           6000;
        Tcommon         1000;
        highCpCoeffs    ( 2.90207649 0.000868992581 -1.6586443e-07 1.90851899e-11 -9.31121789e-16 -797.948726 -0.84559132 );
        lowCpCoeffs     ( 2.37694204 0.00773916922 -1.88735073e-05 1.95517114e-08 -7.17095663e-12 -921.173081 0.547184736 );
    }
    transport
    {
        As              6.362e-07;
        Ts              72;
    }
    elements
    {
        H               2;
    }
}

NO2
{
    specie
    {
        molWeight       46.0055;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           6000;
        Tcommon         1000;
        highCpCoeffs    ( 4.884754 0.0021723955 -8.2806909e-07 1.574751e-10 -1.0510895e-14 2316.4982 -0.11741695 );
        lowCpCoeffs     ( 3.9440312 -0.001585429 1.6657812e-05 -2.0475426e-08 7.8350564e-12 2896.618 6.3119919 );
    }
    transport
    {
        As              1.512e-06;
        Ts              120;
    }
    elements
    {
        N               1;
        O               2;
    }
}

NH2OH
{
    specie
    {
        molWeight       33.03001;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           6000;
        Tcommon         1000;
        highCpCoeffs    ( 3.88112502 0.00815708448 -2.82615576e-06 4.37930933e-10 -2.52724604e-14 -6860.18419 3.79156136 );
        lowCpCoeffs     ( 3.21016092 0.00619671676 1.10594948e-05 -1.96668262e-08 8.8251659e-12 -6581.48481 7.93293571 );
    }
    transport
    {
        As              1.512e-06;
        Ts              120;
    }
    elements
    {
        N               1;
        H               3;
        O               1;
    }
}

HO2
{
    specie
    {
        molWeight       33.00677;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           6000;
        Tcommon         1000;
        highCpCoeffs    ( 4.1056401 0.00204046836 -3.65877562e-07 1.85973044e-11 4.98818315e-16 43.2898769 3.30808126 );
        lowCpCoeffs     ( 4.2625125 -0.00445642032 2.05164934e-05 -2.35794011e-08 9.05614257e-12 262.442356 3.88223684 );
    }
    transport
    {
        As              1.512e-06;
        Ts              120;
    }
    elements
    {
        H               1;
        O               2;
    }
}

H2NN
{
    specie
    {
        molWeight       30.02934;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           6000;
        Tcommon         1000;
        highCpCoeffs    ( 3.0590367 0.00618382347 -2.22171165e-06 3.58539206e-10 -2.14532905e-14 34853.0149 6.69893515 );
        lowCpCoeffs     ( 4.53204001 -0.00732418578 3.00803713e-05 -3.04000551e-08 1.04700639e-11 34958.0003 1.51074195 );
    }
    transport
    {
        As              1.512e-06;
        Ts              120;
    }
    elements
    {
        N               2;
        H               2;
    }
}

HONO2
{
    specie
    {
        molWeight       63.01287;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           6000;
        Tcommon         1000;
        highCpCoeffs    ( 8.03098942 0.00446958589 -1.72459491e-06 2.91556153e-10 -1.80102702e-14 -19313.8183 -16.2616537 );
        lowCpCoeffs     ( 1.69329154 0.0190167702 -8.25176697e-06 -6.06113827e-09 4.65236978e-12 -17419.8909 17.1839838 );
    }
    transport
    {
        As              1.512e-06;
        Ts              120;
    }
    elements
    {
        H               1;
        N               1;
        O               3;
    }
}

HE
{
    specie
    {
        molWeight       4.0026;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           6000;
        Tcommon         1000;
        highCpCoeffs    ( 2.49985609 2.19365392e-07 -1.07525085e-10 2.07198041e-14 -1.39358612e-18 -745.309155 0.929535014 );
        lowCpCoeffs     ( 2.49976293 1.01013432e-06 -8.24578465e-10 -6.85983306e-13 7.24751856e-16 -745.340917 0.929800315 );
    }
    transport
    {
        As              1.512e-06;
        Ts              120;
    }
    elements
    {
        He              1;
    }
}

N2H4
{
    specie
    {
        molWeight       32.04528;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           6000;
        Tcommon         1000;
        highCpCoeffs    ( 4.93957357 0.00875017187 -2.99399058e-06 4.67278418e-10 -2.73068599e-14 9282.65548 -2.69439772 );
        lowCpCoeffs     ( 3.83472149 -0.000649129555 3.76848463e-05 -5.00709182e-08 2.03362064e-11 10089.3925 5.7527203 );
    }
    transport
    {
        As              1.512e-06;
        Ts              120;
    }
    elements
    {
        N               2;
        H               4;
    }
}

O
{
    specie
    {
        molWeight       15.9994;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           6000;
        Tcommon         1000;
        highCpCoeffs    ( 2.55160087 -3.83085457e-05 8.43197478e-10 4.01267136e-12 -4.17476574e-16 29228.7628 4.87617014 );
        lowCpCoeffs     ( 3.15906526 -0.00321509999 6.49255543e-06 -5.98755115e-09 2.06876117e-12 29129.8453 2.09078344 );
    }
    transport
    {
        As              1.512e-06;
        Ts              120;
    }
    elements
    {
        O               1;
    }
}

HNO2
{
    specie
    {
        molWeight       47.01347;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           6000;
        Tcommon         1000;
        highCpCoeffs    ( 4.66358504 0.00489854351 -1.79694193e-06 2.94420361e-10 -1.78235577e-14 -7252.16334 -0.030605364 );
        lowCpCoeffs     ( 4.03779347 -0.00446123109 3.19440815e-05 -3.7935949e-08 1.44570885e-11 -6530.88236 5.90620097 );
    }
    transport
    {
        As              1.512e-06;
        Ts              120;
    }
    elements
    {
        H               1;
        N               1;
        O               2;
    }
}

NH2
{
    specie
    {
        molWeight       16.02264;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           3000;
        Tcommon         1000;
        highCpCoeffs    ( 2.59263049 0.00347683597 -1.08271624e-06 1.49342558e-10 -5.75241187e-15 21573.732 7.90565351 );
        lowCpCoeffs     ( 4.19198016 -0.00204602827 6.67756134e-06 -5.24907235e-09 1.55589948e-12 21186.3286 -0.0904785244 );
    }
    transport
    {
        As              1.512e-06;
        Ts              120;
    }
    elements
    {
        N               1;
        H               2;
    }
}

H2O
{
    specie
    {
        molWeight       18.01534;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           6000;
        Tcommon         1000;
        highCpCoeffs    ( 2.73117512 0.00295136995 -8.35359785e-07 1.26088593e-10 -8.40531676e-15 -29916.9082 6.55183 );
        lowCpCoeffs     ( 4.20147551 -0.00205583546 6.56547207e-06 -5.5290696e-09 1.78282605e-12 -30295.0066 -0.860610906 );
    }
    transport
    {
        As              1.512e-06;
        Ts              120;
    }
    elements
    {
        H               2;
        O               1;
    }
}

NH
{
    specie
    {
        molWeight       15.01467;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           6000;
        Tcommon         1000;
        highCpCoeffs    ( 2.78372644 0.00132985888 -4.24785573e-07 7.83494442e-11 -5.5045131e-15 42346.1945 5.74084863 );
        lowCpCoeffs     ( 3.49295037 0.00031179572 -1.48906628e-06 2.48167402e-09 -1.03570916e-12 42105.9722 1.84834973 );
    }
    transport
    {
        As              1.512e-06;
        Ts              120;
    }
    elements
    {
        N               1;
        H               1;
    }
}

H
{
    specie
    {
        molWeight       1.00797;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           6000;
        Tcommon         1000;
        highCpCoeffs    ( 2.49985211 2.34582548e-07 -1.16171641e-10 2.25708298e-14 -1.52992005e-18 25473.8024 -0.445864645 );
        lowCpCoeffs     ( 2.49975925 6.73824499e-07 1.11807261e-09 -3.70192126e-12 2.14233822e-15 25473.7665 -0.445574009 );
    }
    transport
    {
        As              1.512e-06;
        Ts              120;
    }
    elements
    {
        H               1;
    }
}

AR
{
    specie
    {
        molWeight       39.948;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           6000;
        Tcommon         1000;
        highCpCoeffs    ( 2.49989176 1.56134837e-07 -7.76108557e-11 1.52928085e-14 -1.05304493e-18 -745.328403 4.38029835 );
        lowCpCoeffs     ( 2.49988611 2.1303796e-07 8.97320772e-10 -2.31395752e-12 1.30201393e-15 -745.354481 4.38024367 );
    }
    transport
    {
        As              1.512e-06;
        Ts              120;
    }
    elements
    {
        Ar              1;
    }
}

N2H2
{
    specie
    {
        molWeight       30.02934;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           5000;
        Tcommon         1380;
        highCpCoeffs    ( 4.14686796 0.00481612315 -1.62748817e-06 2.50556098e-10 -1.44494188e-14 23344.4055 0.53412274 );
        lowCpCoeffs     ( 2.55589425 0.00654339081 -8.81947855e-07 -1.15971304e-09 3.9744223e-13 24108.5081 9.80504705 );
    }
    transport
    {
        As              1.512e-06;
        Ts              120;
    }
    elements
    {
        N               2;
        H               2;
    }
}

NO
{
    specie
    {
        molWeight       30.0061;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           6000;
        Tcommon         1000;
        highCpCoeffs    ( 3.26071234 0.00119101135 -4.29122646e-07 6.94481463e-11 -4.03295681e-15 9921.43132 6.36900518 );
        lowCpCoeffs     ( 4.21859896 -0.00463988124 1.10443049e-05 -9.34055507e-09 2.80554874e-12 9845.09964 2.28061001 );
    }
    transport
    {
        As              1.512e-06;
        Ts              120;
    }
    elements
    {
        N               1;
        O               1;
    }
}
